export default function AIFeedbackInfo() {
  return (
    <>
      <h1 className="text-2xl">AI 피드백 서비스</h1>
      <p className="text-lg text-adaptorsGray py-4 leading-relaxed">
        AI 피드백 서비스란?
        <br />
        Adaptors의 AI 피드백 서비스는 자기소개서, 포트폴리오, 이력서와 같은 취업
        관련 문서를 지능적으로 분석하여 사용자의 역량을 극대화하는 혁신적인
        솔루션입니다. 이 서비스의 핵심은 AI 기반 맞춤 피드백입니다.
        <br />
        사용자가 업로드한 문서를 정밀하게 분석하여 강점과 개선점을 명확히
        제시하고, 문서의 설득력을 높입니다. 단순히 문장을 고치는 것을 넘어
        논리적 구성, 강점 강조, 문장 개선 등 종합적인 멘토링을 제공합니다. 기존
        멘토링 이용 기록이 있다면, 축적된 데이터를 바탕으로 더욱 개인화된
        피드백을 제공합니다.
        <br />
        자기소개서부터 포트폴리오, 이력서까지 다양한 문서 유형을 지원하며,
        지원하고자 하는 직무와 업계에 최적화된 조언을 드립니다. Adaptors의 AI
        피드백 서비스는 단순한 문서 분석을 넘어 사용자 개인의 성장 잠재력을
        발견하고 현실화하는 진정한 파트너입니다. 여러분의 꿈을 한 단계 더 가까이
        만들어줄 혁신적인 서비스, 지금 바로 경험해보세요! 🚀
      </p>
    </>
  );
}
